Tekla.Structures.Drawing.LinkFrameAttributes
The LinkFrameAttributes class contains the attributes for controlling the appearance of
a link frame.

Tekla.Structures.Drawing.LinkFrameAttributes.Line
Gets or sets the line type.
Tekla.Structures.Drawing.LineTypeAttributes

Tekla.Structures.Drawing.LinkFrameAttributes.Width
The width of the frame

Tekla.Structures.Drawing.LinkFrameAttributes.Height
The height of the frame

Tekla.Structures.Drawing.LinkFrameAttributes.Angle
The angle of the frame (compared to X-axis)

Tekla.Structures.Drawing.LinkFrameAttributes.InsertionPoint
The InsertionPoint of the frame (CenterPoint)

Tekla.Structures.Drawing.LinkFrameAttributes.LineType
Deprecated, use Line instead

Tekla.Structures.Drawing.LinkFrameAttributes.Color
Deprecated, use Line instead

Tekla.Structures.Drawing.LinkFrameAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.LinkFrameAttributes.GetObjectAlignedBoundingBox
Gets the bounding box of the frame in the local coordinate system.
Returns: The bounding box of the frame in the local coordinate system.

Tekla.Structures.Drawing.LinkFrameAttributes.GetAxisAlignedBoundingBox
Gets the bounding box of the frame in the global axis coordinate system.
Returns: The bounding box of the frame in the global axis coordinate system.